БукмекерскаяКонтора/src/Documents/РезультатыМероприятия/РезультатыМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатыМероприятия</name>
  <registerRecords>AccumulationRegister.Депозиты</registerRecords>
  <registerRecords>AccumulationRegister.Ставки</registerRecords>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Исходы</name>
    <attributes>
      <name>Исход</name>
      <type>
        <types>CatalogRef.Исходы</types>
      </type>
    </attributes>
    <attributes>
      <name>Верный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БукмекерскаяКонтора/src/AccumulationRegisters/Депозиты/Депозиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Депозиты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРезерва</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БукмекерскаяКонтора/src/AccumulationRegisters/Ставки/Ставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Ставки</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ставка</name>
    <type>
      <types>CatalogRef.Исходы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БукмекерскаяКонтора/src/Documents/Ставка/Ставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Ставка</name>
  <registerRecords>AccumulationRegister.Депозиты</registerRecords>
  <attributes>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </attributes>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Исход</name>
    <type>
      <types>CatalogRef.Исходы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусСтавки</types>
    </type>
  </attributes>
</mdclass:Document>

БукмекерскаяКонтора/src/Documents/РезультатыМероприятия/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Депозиты.Записывать = Истина;
	Движения.Ставки.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать
	|	Ставка.Ссылка,
	|	Ставка.Игрок,
	|	Ставка.Исход,
	|	Ставка.Сумма
	|Из
	|	Документ.Ставка как Ставка
	|Где
	|	Ставка.Мероприятие = &Мероприятие и
	|	Ставка.Проведен = Истина
	|";
	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	Ставки = Запрос.Выполнить().Выбрать();
	
	Пока Ставки.Следующий() Цикл
		Строка = Исходы.Найти(Ставки.Исход, "Исход");
		Движение = Движения.Депозиты.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Игрок = Ставки.Игрок;
		Движение.Сумма = Ставки.Сумма;
		Движения.СуммаРезерва = Ставки.Сумма;
		Если Строка.Верный
		Тогда
			Движение = Движения.Депозиты.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Игрок = Ставки.Игрок;
			Движение.Сумма = Ставки.Сумма * Строка.Исход.Коэффициент;
			Движение.СуммаРезерва = 0;
			
			Движение = Движения.Ставки.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Игрок = Ставки.Игрок;
			Движение.Ставка = Ставки.Ссылка;
			Движение.Сумма = Ставки.Сумма * (Строка.Исход.Коэффициент - 1);
		Иначе
			Движение = Движения.Ставки.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Игрок = Ставки.Игрок;
			Движение.Ставка = Ставки.Ссылка;
			Движение.Сумма = Ставки.Сумма;
		КонецЕсли
		
	КонецЦикла;
КонецПроцедуры
